# Pandas Tutorial(2)

https://github.com/adeshpande3/Pandas-Tutorial/blob/master/Pandas%20Tutorial.ipynb 의 자료를 기반으로 작성함.

In [14]:
import pandas as pd

## 데이터 프레임 다루기

In [31]:
d = {'Name':['예리','장원영','안유진','나연',
            '모모','채령','카리나','지수','윤','다영'],
    'Group':['레드벨벳','아이브','아이브','트와이스','트와이스',
             '있지','에스파','블랙핑크','스테이씨','우주소녀'],
    'Age':[24,19,20,28,26,22,23,28,19,24]}
    

df = pd.DataFrame(d)
df

  Name Group  Age
0   예리  레드벨벳   24
1  장원영   아이브   19
2  안유진   아이브   20
3   나연  트와이스   28
4   모모  트와이스   26
5   채령    있지   22
6  카리나   에스파   23
7   지수  블랙핑크   28
8    윤  스테이씨   19
9   다영  우주소녀   24

In [32]:
df['Age']

0    24
1    19
2    20
3    28
4    26
5    22
6    23
7    28
8    19
9    24
Name: Age, dtype: int64

## 행과 열을 추출하기

두 개 이상의 열을 반환하고 싶으면 아래와 같이 리스트 형태로 인덱싱 한다.

In [33]:
df[['Name','Age']]

  Name  Age
0   예리   24
1  장원영   19
2  안유진   20
3   나연   28
4   모모   26
5   채령   22
6  카리나   23
7   지수   28
8    윤   19
9   다영   24

인덱싱을 할 `[]` 안에 하나의 값을 쓰느냐, 리스트 형태를 쓰느냐에 따라 반환되는 값의 타입이 달라진다.하나 갑승ㄹ 쓰는 경우는 시리즈를, 리스트 형태를 쓰면 데이터프레임을 반환한다.

In [34]:
type(df['Name'])

pandas.core.series.Series

In [35]:
type(df[['Name']])

pandas.core.frame.DataFrame

`[]` 안에 열 이름이 아닌 숫자를 쓰면 행 반환이 가능하다. 단 이 경우는 슬라이싱만 가능하다.

In [36]:
df[0:3] #df[2]는 에러

  Name Group  Age
0   예리  레드벨벳   24
1  장원영   아이브   19
2  안유진   아이브   20

## loc,iloc을 이용한 인덱싱과 슬라이싱

loc과 iloc 모두 행(row)이나 열(column)을 인덱싱 하기 위한 함수다.
- iloc은 numpy 인덱싱과 유사하게 작동하며, 저장된 순서에 따라 0부터 정수로 인덱싱, 슬라이싱이 가능하다.  
- loc은 데이터프레임에 정의된 index에 대해 인덱싱이 작동한다.
슬라이싱의 경우 loc은 index 값 크기와 무관하게 순서에 따라 슬라이싱이 작동한다.

**iloc은 위치를 보고 loc은 라벨을 본다.**

In [39]:
df=df.reindex([1,4,6,2,3,5,9,8,0,7]) #인덱스를 부여
df

  Name Group   Age
1  장원영   아이브  19.0
4   모모  트와이스  26.0
6  카리나   에스파  23.0
2  안유진   아이브  20.0
3   나연  트와이스  28.0
5   채령    있지  22.0
9   다영  우주소녀  24.0
8    윤  스테이씨  19.0
0   예리  레드벨벳  24.0
7   지수  블랙핑크  28.0

In [40]:
df.loc[:6]

  Name Group   Age
1  장원영   아이브  19.0
4   모모  트와이스  26.0
6  카리나   에스파  23.0

`iloc` 과 `loc`의 중요한 차이 점은, loc은 인덱싱 하는 값을 포함하여 결과를 반환한다는 것이다.

In [41]:
df.iloc[:6]

  Name Group   Age
1  장원영   아이브  19.0
4   모모  트와이스  26.0
6  카리나   에스파  23.0
2  안유진   아이브  20.0
3   나연  트와이스  28.0
5   채령    있지  22.0

In [42]:
# sort the pandas dataframe by index ascending
 
df1=df.sort_index()
df1

  Name Group   Age
0   예리  레드벨벳  24.0
1  장원영   아이브  19.0
2  안유진   아이브  20.0
3   나연  트와이스  28.0
4   모모  트와이스  26.0
5   채령    있지  22.0
6  카리나   에스파  23.0
7   지수  블랙핑크  28.0
8    윤  스테이씨  19.0
9   다영  우주소녀  24.0

In [43]:
df1.iloc[:6]

  Name Group   Age
0   예리  레드벨벳  24.0
1  장원영   아이브  19.0
2  안유진   아이브  20.0
3   나연  트와이스  28.0
4   모모  트와이스  26.0
5   채령    있지  22.0

In [44]:
df1.loc[:6] #인덱싱 값을 포함하여 반환

  Name Group   Age
0   예리  레드벨벳  24.0
1  장원영   아이브  19.0
2  안유진   아이브  20.0
3   나연  트와이스  28.0
4   모모  트와이스  26.0
5   채령    있지  22.0
6  카리나   에스파  23.0

In [45]:
# sort the pandas dataframe by index descending

df2 = df.sort_index(ascending=False)
df2

  Name Group   Age
9   다영  우주소녀  24.0
8    윤  스테이씨  19.0
7   지수  블랙핑크  28.0
6  카리나   에스파  23.0
5   채령    있지  22.0
4   모모  트와이스  26.0
3   나연  트와이스  28.0
2  안유진   아이브  20.0
1  장원영   아이브  19.0
0   예리  레드벨벳  24.0

## loc과 iloc을 이용해 열(column) 추출하기

In [48]:
df2.iloc[:,2] #2번째 열을 추출

9    24.0
8    19.0
7    28.0
6    23.0
5    22.0
4    26.0
3    28.0
2    20.0
1    19.0
0    24.0
Name: Age, dtype: float64

In [50]:
df2.loc[:,['Age']]

    Age
9  24.0
8  19.0
7  28.0
6  23.0
5  22.0
4  26.0
3  28.0
2  20.0
1  19.0
0  24.0

In [53]:
df2.iloc[:,:2]

  Name Group
9   다영  우주소녀
8    윤  스테이씨
7   지수  블랙핑크
6  카리나   에스파
5   채령    있지
4   모모  트와이스
3   나연  트와이스
2  안유진   아이브
1  장원영   아이브
0   예리  레드벨벳

In [54]:
df2.loc[:,['Name','Group']]

  Name Group
9   다영  우주소녀
8    윤  스테이씨
7   지수  블랙핑크
6  카리나   에스파
5   채령    있지
4   모모  트와이스
3   나연  트와이스
2  안유진   아이브
1  장원영   아이브
0   예리  레드벨벳

## CSV 파일에서 읽어오기

CSV 파일은 데이터 분석에서 가장 많이 사용하는 데이터 파일 포맷으로, pandas에서 쉽게 읽어들일 수 있다.

**pd.read_csv()** 를 이용하여 읽어들이면 **dataframe** 변수 형태로 반환한다.

**Example CSV file** : Company Funding Records
The TechCrunch Continental USA file is a listing of 1,460 company funding records reported by TechCrunch. As part of the import process, geocode these records using the city and state information in the file.  Try adding another map layer with the Dataset Configuration Panel so you can visualize both a heatmap and graduated circles with the same dataset.

출처 : https://support.spatialkey.com/spatialkey-sample-csv-data/

In [55]:
df = pd.read_csv('TechCrunchcontinentalUSA.csv')

## 데이터 프레임 함수들

위 예에서 `df`는 데이터프레임을 가리키는 변수다. 데이터프레임은 많은 수의 행을 가지므로, 간단히 첫 몇줄만 보고 싶다면 `head()` 함수를 쓰고, 마지막 몇 줄을 보고 싶다면 `tail()` 함수를 사용한다.

In [56]:
df.head()

,permalink,company,numEmps,category,city,state,fundedDate,raisedAmt,raisedCurrency,round
0,lifelock,LifeLock,NaN,web,Tempe,AZ,1-May-07,6850000,USD,b
1,lifelock,LifeLock,NaN,web,Tempe,AZ,1-Oct-06,6000000,USD,a
2,lifelock,LifeLock,NaN,web,Tempe,AZ,1-Jan-08,25000000,USD,c
3,mycityfaces,MyCityFaces,7.0,web,Scottsdale,AZ,1-Jan-08,50000,USD,seed
4,flypaper,Flypaper,NaN,web,Phoenix,AZ,1-Feb-08,3000000,USD,a

In [58]:
df.tail()

,permalink,company,numEmps,category,city,state,fundedDate,raisedAmt,raisedCurrency,round
1455,trusera,Trusera,15.0,web,Seattle,WA,1-Jun-07,2000000,USD,angel
1456,alerts-com,Alerts.com,NaN,web,Bellevue,WA,8-Jul-08,1200000,USD,a
1457,myrio,Myrio,75.0,software,Bothell,WA,1-Jan-01,20500000,USD,unattributed
1458,grid-networks,Grid Networks,NaN,web,Seattle,WA,30-Oct-07,9500000,USD,a
1459,grid-networks,Grid Networks,NaN,web,Seattle,WA,20-May-08,10500000,USD,b

데이터 프레임의 `shape` 속성은 행과 열의 수를 나타낸다.

In [60]:
df.shape

(1460, 10)

`columns` 속성과 `tolist()` 함수를 이용하면 열 이름들을 리스트로 반환 할 수 있다.

In [61]:
df.columns.tolist()

['permalink',
 'company',
 'numEmps',
 'category',
 'city',
 'state',
 'fundedDate',
 'raisedAmt',
 'raisedCurrency',
 'round']

각 열에 대해 평균, 최소값 등 다양한 통계량을 보고싶다면 `describe()` 함수를 사용한다.

In [62]:
df.describe()

            numEmps     raisedAmt
count    567.000000  1.460000e+03
mean      95.721340  1.013149e+07
std      867.524287  1.866146e+07
min        0.000000  6.000000e+03
25%        8.000000  2.000000e+06
50%       20.000000  5.500000e+06
75%       50.000000  1.102500e+07
max    20000.000000  3.000000e+08

`max()` 함수를 이용하면 원하는 열이나 전체 열의 최대값을 구할 수 있다.

In [63]:
df.max()

permalink                zynga
company                  xkoto
numEmps                20000.0
state                       WA
fundedDate            9-Nov-07
raisedAmt            300000000
raisedCurrency             USD
round             unattributed
dtype: object

특정 열의 최대 값을 구하고 싶으면 아래와 같이 쓴다.

In [64]:
df['raisedAmt'].max() #raisedAmt 최대값

300000000

평균을 구하고 싶다면 아래와 같이 쓴다.

In [65]:
df['numEmps'].mean() #numEmps 평균값

95.72134038800705

raisedAmt 수치가 최대인 행 위치(index)를 알고 싶다면, `argmax()` 함수를 사용한다.

In [66]:
df['raisedAmt'].argmax()

14

향후 `argmax` 대신 `idxmax` 를 쓰도록 권장하므로, `idmax`로 고쳐서 쓴다.

In [67]:
df.loc[14] #반환된 index 값을 이용해 값을 출력

permalink          facebook
company            Facebook
numEmps               450.0
category                web
city              Palo Alto
state                    CA
fundedDate         1-Oct-07
raisedAmt         300000000
raisedCurrency          USD
round                     c
Name: 14, dtype: object

In [69]:
df.loc[df['raisedAmt'].idxmax()] #위 과정을 하나로 합침

permalink          facebook
company            Facebook
numEmps               450.0
category                web
city              Palo Alto
state                    CA
fundedDate         1-Oct-07
raisedAmt         300000000
raisedCurrency          USD
round                     c
Name: 14, dtype: object

유용하게 쓰이는 함수 중 하나는 `value_counts()` 함수로, 특정 열에 사용된 값들에 대해 횟수를 계산하여 보여준다.

In [70]:
df['city'].value_counts()

San Francisco     228
New York           93
Mountain View      89
Palo Alto          78
Seattle            75
                 ...
North Andover       1
Ann Arbor           1
Marina Del Rey      1
Wayne               1
Kennebunk           1
Name: city, Length: 193, dtype: int64

## 데이터 프레임 값 추출

데이터프레임 변수에 열의 이름을 사용하여 인덱싱하면, 특정 열의 값만을 추출할 수 있다. raisedAmt 값만 추출하고 싶다면 아래와 같이 인덱싱 한다.

In [75]:
city = df['raisedAmt']
city.head() #갯수가 너무 많으므로 뒤에 head() 함수를 써서 앞 부분만 추출

0     6850000
1     6000000
2    25000000
3       50000
4     3000000
Name: raisedAmt, dtype: int64

In [76]:
df.loc[[df['raisedAmt'].idxmax()]]

,permalink,company,numEmps,category,city,state,fundedDate,raisedAmt,raisedCurrency,round
14,facebook,Facebook,450.0,web,Palo Alto,CA,1-Oct-07,300000000,USD,c

위 결과와 아래 결과 차이를 비교.

In [78]:
df.loc[df['raisedAmt'].idxmax()]

permalink          facebook
company            Facebook
numEmps               450.0
category                web
city              Palo Alto
state                    CA
fundedDate         1-Oct-07
raisedAmt         300000000
raisedCurrency          USD
round                     c
Name: 14, dtype: object

위의 예에서 좀더 나아가, raisedAmt 수치가 높은 값에서 numEmps 가 낮은 점수만 가져오고 싶다면?

In [81]:
df.loc[[df['raisedAmt'].idxmax()]]['numEmps']

14    450.0
Name: numEmps, dtype: float64

In [82]:
df.loc[df['raisedAmt'].idxmax()]['numEmps']

450.0

아래와 같이 loc에 행과 열을 동시에 인덱싱 하는 것도 가능하다.

In [83]:
df.loc[df['raisedAmt'].idxmax(),'numEmps']

450.0

출력되는 모양을 보면 데이터프레임인지 아니면 시리즈인지 알 수 있다. 위의 예는 Series 임을 알 수 있다. 보다 명확하게 데이터형을 알고 싶다면 아래와 같이 `type()` 함수를 써서 확인한다.

In [86]:
type(df.loc[[df['raisedAmt'].idxmax()]]['numEmps'])

pandas.core.series.Series

In [88]:
type(df.loc[[df['raisedAmt'].idxmax()]])

pandas.core.frame.DataFrame